### 1. Limpieza de datos

In [2]:
# Librerías
import pandas as pd
import numpy as np
#from pandasgui import show

#### Carga de datos

In [39]:
nls97 = pd.read_csv(filepath_or_buffer = './data/nls97.csv', index_col = 'personid')
# nls97.head()
# nls97.tail()
# nls97.info()
# nls97.dtypes
# nls97.shape
nls97.head().T

personid,100061,100139,100284,100292,100583
gender,Female,Male,Male,Male,Male
birthmonth,5,9,11,4,1
birthyear,1980,1983,1984,1982,1980
highestgradecompleted,13.0,12.0,7.0,NaN,13.0
maritalstatus,Married,Married,Never-married,NaN,Married
...,...,...,...,...,...
colenroct15,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
colenrfeb16,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,1. Not enrolled
colenroct16,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,1. Not enrolled
colenrfeb17,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,1. Not enrolled
colenroct17,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,1. Not enrolled

#### Selección de filas y columnas

In [36]:
# Selección de filas y columnas al mismo tiempo
lowsleep3pluschildren = \
  nls97.loc[(nls97.nightlyhrssleep<=lowsleepthreshold)
    & (nls97.childathome>=3),
    ['nightlyhrssleep','childathome']]
lowsleep3pluschildren.shape

(623, 2)

#### Transformar columnas de tipo object en category

In [53]:
nls97abb = nls97.iloc[:,:20]

# Seleccionar columnas de tipo object y transformarlas en categorías
catcols = nls97abb.select_dtypes( include=['object'] ).columns
nls97abb = nls97abb[catcols].apply(lambda x: x.astype('category'))
nls97abb.dtypes

gender               category
maritalstatus        category
weeklyhrscomputer    category
weeklyhrstv          category
highestdegree        category
govprovidejobs       category
govpricecontrols     category
dtype: object